src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ОбщийМодульВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Получить цену и вид номенклатуры.
// 
// Параметры:
//  Период - Дата
//  Номенклатура - СправочникСсылка.Номенклатура - справочник "Номенклатура"
// 
// Возвращаемое значение:
//  Структура - Получить цену и вид номенклатуры:
// * ИмяВидаНоменклатуры - Строка
// * Цена - Число
Функция ПолучитьЦенуИВидНоменклатуры(Период, Номенклатура) Экспорт
	
	ВидНоменклатуры = ПолучитьВидНоменклатуры(Номенклатура);
	ИндексНоменклатуры = Перечисления.ВидНоменклатуры.Индекс(ВидНоменклатуры);
	ИмяВидаНоменклатуры = Метаданные.Перечисления.ВидНоменклатуры.ЗначенияПеречисления[ИндексНоменклатуры].Имя;
	ЦенаНоменклатуры = ПолучитьЦенуНоменклатуры(Период, Номенклатура);
	Результат = Новый Структура("ИмяВидаНоменклатуры, Цена", ИмяВидаНоменклатуры, ЦенаНоменклатуры);

	Возврат Результат;
	
КонецФункции

// Получить текущую дату.
// 
// Возвращаемое значение:
//  Дата - Получить текущую дату
Функция ПолучитьТекущуюДату() Экспорт
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВидНоменклатуры(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидНоменклатуры;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЦенуНоменклатуры(Период, Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК
		|		ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Цена;
	
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//#КонецОбласти
